In [1]:
# materi Series as dictionary 
#studi kasus buat object series yang memiliki key dan value
import pandas as pd 
object_series=pd.Series([1,2,3,4], index=['a','b','c','d'])
print(object_series)

a    1
b    2
c    3
d    4
dtype: int64

In [2]:
# Studi kasus jika sy ingin mengetahui index key dalam object series
print(object_series.keys())

Index(['a', 'b', 'c', 'd'], dtype='object')

In [3]:
# Studi kasus jika saya ingin mengetahui adakah key dengan nama 'b' di data object_series mengembalikan nilai true or false
print('a' in object_series)

True

In [4]:
# Studi kasusnya jika saya ingin mengetahui value dari oject data series tersebut 
print(object_series.values)

[1 2 3 4]

In [9]:
# Series as Array
# studi kasus bagiamana jika saya mengakses data dari index a sampai c
object_series['a':'c']

a    1
b    2
c    3
dtype: int64

In [10]:
# studi kasus bagiamana jika saya mengakses data sampai 3
object_series[:3]

a    1
b    2
c    3
dtype: int64

In [13]:
#Indexing menggunaka .loc dan .iloc series
#bagaimana menampilkan data dari index 'a' sampai 'c' menggunakan method loc
#loc indexing lebih ke munggunakan label utk menampilkan data
object_series.loc['a':'c']

a    1
b    2
c    3
dtype: int64

In [21]:
# Studi kasus bagaimana menampilkan data dengan ilco lebih ke posisi object
object_series.iloc[:3]

a    1
b    2
c    3
dtype: int64

In [22]:
# Studi kasus menampilkan data denga lebih dari 2
object_series[object_series>2]

c    3
d    4
dtype: int64

In [24]:
object_series[['a','b']]

a    1
b    2
dtype: int64

In [31]:
# Ada banyak cara-cara kita indexing suatu dataframe. diantranya adalah dengan menggunakan :

# dataframe[] : cara seperti ini dikenal sebagai index operator.
# dataframe.kolom : cara seperti ini dikenal dengan indexing menggunakan atribut
# dataframe.loc[]: operator yang menggunakan label untuk mengakses data, jika misalkan kamu melakukan dataframe.loc[‘jumlah’], berarti kamu hendak mengakses data yang mempunyai index jumlah
# dataframe.iloc[: operator yang menggunakan posisi index untuk mengakses data. jikalau kamu melakukan dataframe.iloc[2] berarti kamu hendak mengakses dataframe dengan index posisi 2

datacovid=pd.read_csv('datacovid.csv')
display(datacovid.head())

,iso_code,continent,location,date,total_cases,new_cases,new_cases_smoothed,total_deaths,new_deaths,new_deaths_smoothed,...,gdp_per_capita,extreme_poverty,cardiovasc_death_rate,diabetes_prevalence,female_smokers,male_smokers,handwashing_facilities,hospital_beds_per_thousand,life_expectancy,human_development_index
0,AFG,Asia,Afghanistan,2020-02-24,1.0,1.0,NaN,NaN,NaN,NaN,...,1803.987,NaN,597.029,9.59,NaN,NaN,37.746,0.5,64.83,0.511
1,AFG,Asia,Afghanistan,2020-02-25,1.0,0.0,NaN,NaN,NaN,NaN,...,1803.987,NaN,597.029,9.59,NaN,NaN,37.746,0.5,64.83,0.511
2,AFG,Asia,Afghanistan,2020-02-26,1.0,0.0,NaN,NaN,NaN,NaN,...,1803.987,NaN,597.029,9.59,NaN,NaN,37.746,0.5,64.83,0.511
3,AFG,Asia,Afghanistan,2020-02-27,1.0,0.0,NaN,NaN,NaN,NaN,...,1803.987,NaN,597.029,9.59,NaN,NaN,37.746,0.5,64.83,0.511
4,AFG,Asia,Afghanistan,2020-02-28,1.0,0.0,NaN,NaN,NaN,NaN,...,1803.987,NaN,597.029,9.59,NaN,NaN,37.746,0.5,64.83,0.511

In [32]:
#indexing operator as dataFrame
datapertama=datacovid.head()
display(datapertama['location'])

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: location, dtype: object

In [33]:
#indexing using atribute
datapertama.location

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: location, dtype: object

In [35]:
#indexing using menggunakan .loc 
datacovide.loc[:,['diabetes_prevalence','cardiovasc_death_rate']].head(10)

   diabetes_prevalence  cardiovasc_death_rate
0                 9.59                597.029
1                 9.59                597.029
2                 9.59                597.029
3                 9.59                597.029
4                 9.59                597.029
5                 9.59                597.029
6                 9.59                597.029
7                 9.59                597.029
8                 9.59                597.029
9                 9.59                597.029

In [39]:
datapertama.iloc[:,[1,2]].head(10)

  continent     location
0      Asia  Afghanistan
1      Asia  Afghanistan
2      Asia  Afghanistan
3      Asia  Afghanistan
4      Asia  Afghanistan

In [7]:
import pandas as pd
datatitanic=pd.read_csv('titanic.csv')

display(datatitanic.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:

# 1. Tunjukan kepada saya semua data orang-orang yang selamat!!

dataselamat=datatitanic.Survived==1
display(datatitanic[dataselamat])

# 2. Tunjukan kepada saya semua data laki-laki yang selamat.
dataselamat_laki=datatitanic.Sex=='male'
data_semua_laki_selamat=datatitanic[dataselamat & dataselamat_laki]
display(data_semua_laki_selamat)

# 3. Tunjukan kepada saya semua data tentang perempuan yang tidak selamat di umur lebih dari 40 tahun atau kurang dari 20 tahun.
data_tidak_selamat=datatitanic.Survived==0
perempuan=datatitanic.Sex=='female'
umur_lebih=datatitanic.Age>40
umur_kurang=datatitanic.Age<20
display(datatitanic[(data_tidak_selamat & perempuan) & umur_lebih | umur_kurang])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [19]:
# kita kembali akan menggunakan data tentang titanic. misalkan kita ingin mengubah data kita, dimana kita ingin mengubah column age, semua nilainya di kurangi dengan nilai minimum dari kolumn tersebut. maka pertama kita definiskan fungsi tersebut.
def minus_minumun(x):
    return (x-x.min())/(x.max()-x.min())
# setelah kita mendefinisikan fungsinya. sekarang kita akan menggunakan method apply() dari pandas. method apply ini akan menerima suatu fungsi kemudian ‘meng-apply’ fungsi tersebut ke dalam setiap sumbu dari dataframe, secara default sumbu yang ‘apply’ adalah sumbu column. langsung saja kita perlihatkan. sebelum nykita lihat dulu data awal kita seperti apa.
datatitanic['Age']=minus_minumun(datatitanic['Age'])

display('Data setelah di tranformasi :',datatitanic)

'Data setelah di tranformasi :'

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,0.271174,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.472229,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0.321438,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.434531,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0.434531,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0.334004,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,0.233476,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,0.321438,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,0.396833,0,0,370376,7.7500,NaN,Q

In [ ]:
#Catatan Penting yang harus di pahami

DATAFRAME INDEXING
indexing operator, DataFrame []
DataFrame.loc[]>> berdasarkan label baris maupun kolom
DataFrame.iloc[]>> berdasarkan poisi baris dan kolom
DataFrame.(attribute)

Identifier Vlid Python >>  tidak mengandung space, dan tanda penghubung menggunakan '_'

Akses Column dan baris


Filtering DataFrane operator bitwise
& => and
for =>for
| => OR

Transformasi Data 
  buatkan sebuah fungsi